# -*- coding: utf-8 -*-
"""
Created on Mon Apr 27 09:23:33 2020

@author: USER
"""


'''
머신러닝
크게 2가지

지도학습 - 이미 알려진 사례를 바탕으로 일반화된 모델을 만들어서 의사결정 프로세스를 자동화 하는것.
알아서 학습히게끔  반드시 문제와 정답이 있어야 한다.

비 지도학습 -  알고리즘 이라는 이라는 개념
논문을 토대로 - 알고리즘을 짜는데
학습 데이터 만 있음. 답은 스스로 내는것

공통점 '컴퓨터가 인식할수 있는 형태로!!'  데이터를 준비시켜야 한다.


특성  -  데이터의 특성에 대해..예) 붓꽃 - 꽃바침의 넓이, 줄기 길이
과 생플(데이터 포인트) - 특성에 대한 데이터가 여러개 있으니 그 데이터를 알려주는 샘플의 위치, 데이터 포인트


# 고민해야 할 점
1) 주제! 어떤질문? 어떤결과나올까?
2) 어떤 방식으로 머신러닝에 응용시킬것인가 , 가장잘맞는 기술(알고리즘) 은 무었은가
3) 문제를 풀기위한 학습용 데이터가 충분한가
4) 내가 모은 데이터에 특성들이 내가 원하는 답에대한 좋은 예측을 나올 수 있을것인지?
5) 머신러닝의 결과는 어떤 측정방법으로, 성과를 어떻게 낼것인가
6) 머신러닝을 한것으로 어떤 도움이 될건지? 연구에 도움인가 , 상업용 제품에 활용인가.


# 최총포폴리오등에서도
1) 주제?
2) 어떤 방식으로 만들까
3) 필요한 데이터가 있나
4) 데이터로 주제에 맞게 나올수 있나



1-2 파이썬
sickit-learn
#파이썬 머신러닝 라이브러리 이용 (numpy, Scipy 를 이용해서 만들어진 모듈)
# 

개발환경!!
파이썬, 파이참, 아나콘다? vs코드 등 환경 선택

- scipy 특징
- 과학 함수용 함수를 모아둔 패키지
- 희소행렬 - 0을 많이 포함한 2차원 배열 저장시 필요한 모듈

- 시각화 작업이 필요하다. 내가 원한 데이터를 위해


- 가장 많이 쓰는 자료구조 pandas
- 데이터 프레임, 내부구조는 Series( 리스트 형태도 띄지만 dictionary 형태도 띤다.)
'''

